app/controllers/things_controller.rb

INSERT INTO "things" ("updated_at", "text", "created_at") VALUES('2009-02-04 00:18:25', 'hi there', '2009-02-04 00:18:25')
---
  def add
    thing = Thing.new
    thing.text = params[:text]

    if thing.save

SELECT * FROM "things" WHERE (created_at >= '2009-02-03') ORDER BY created_at desc
DELETE FROM "things" WHERE "id" = 21
---
  def delete
    thing = Thing.find(params[:id])
    thing.destroy